; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_14_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 - counter
	)
  (:init
		(= (value c0) 6)
	(= (value c1) 30)
	(= (value c2) 35)
	(= (value c3) 59)
	(= (value c4) 15)
	(= (value c5) 8)
	(= (value c6) 22)
	(= (value c7) 29)
	(= (value c8) 24)
	(= (value c9) 45)
	(= (value c10) 5)
	(= (value c11) 95)
	(= (value c12) 41)
	(= (value c13) 4)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
		)
	)
)

; plan
1. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 7 of 13
2. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 7 of 13
3. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 7 of 13
4. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 7 of 13
5. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 7 of 13
6. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 7 of 13
7. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 13
8. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 7 of 13
9. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 13
10. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 7 of 13
11. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 7 of 13
12. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 7 of 13
13. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 7 of 13
14. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 7 of 13
15. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 13
16. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 13
17. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 13
18. (increment c8)
   changed: (value c8) from 24 to 27
   goals met: 7 of 13
19. (increment c8)
   changed: (value c8) from 27 to 30
   goals met: 8 of 13
20. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 8 of 13
21. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 8 of 13
22. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 8 of 13
23. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 8 of 13
24. (increment c5)
   changed: (value c5) from 8 to 12
   goals met: 8 of 13
25. (increment c5)
   changed: (value c5) from 12 to 16
   goals met: 9 of 13
26. (increase_rate c13)
   changed: (rate_value c13) from 5 to 6
   goals met: 9 of 13
27. (increase_rate c13)
   changed: (rate_value c13) from 6 to 7
   goals met: 9 of 13
28. (increment c13)
   changed: (value c13) from 4 to 11
   goals met: 9 of 13
29. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 9 of 13
30. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 9 of 13
31. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 9 of 13
32. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 9 of 13
33. (increase_rate c12)
   changed: (rate_value c12) from 5 to 6
   goals met: 9 of 13
34. (increment c13)
   changed: (value c13) from 11 to 18
   goals met: 9 of 13
35. (increment c13)
   changed: (value c13) from 18 to 25
   goals met: 9 of 13
36. (increment c13)
   changed: (value c13) from 25 to 32
   goals met: 9 of 13
37. (increment c13)
   changed: (value c13) from 32 to 39
   goals met: 9 of 13
38. (increment c13)
   changed: (value c13) from 39 to 46
   goals met: 10 of 13
39. (increase_rate c12)
   changed: (rate_value c12) from 6 to 7
   goals met: 10 of 13
40. (increase_rate c12)
   changed: (rate_value c12) from 7 to 8
   goals met: 10 of 13
41. (increment c12)
   changed: (value c12) from 41 to 49
   goals met: 9 of 13
42. (increment c13)
   changed: (value c13) from 46 to 53
   goals met: 10 of 13
43. (increment c12)
   changed: (value c12) from 49 to 57
   goals met: 9 of 13
44. (increment c12)
   changed: (value c12) from 57 to 65
   goals met: 9 of 13
45. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 9 of 13
46. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 9 of 13
47. (increase_rate c12)
   changed: (rate_value c12) from 8 to 9
   goals met: 9 of 13
48. (increment c12)
   changed: (value c12) from 65 to 74
   goals met: 9 of 13
49. (increase_rate c12)
   changed: (rate_value c12) from 9 to 10
   goals met: 9 of 13
50. (increment c13)
   changed: (value c13) from 53 to 60
   goals met: 9 of 13
51. (increment c12)
   changed: (value c12) from 74 to 84
   goals met: 9 of 13
52. (increment c12)
   changed: (value c12) from 84 to 94
   goals met: 9 of 13
53. (decrement c11)
   changed: (value c11) from 95 to 93
   goals met: 10 of 13
54. (increase_rate c13)
   changed: (rate_value c13) from 7 to 8
   goals met: 10 of 13
55. (increase_rate c13)
   changed: (rate_value c13) from 8 to 9
   goals met: 10 of 13
56. (increase_rate c13)
   changed: (rate_value c13) from 9 to 10
   goals met: 10 of 13
57. (increment c13)
   changed: (value c13) from 60 to 70
   goals met: 10 of 13
58. (increment c13)
   changed: (value c13) from 70 to 80
   goals met: 10 of 13
59. (increment c13)
   changed: (value c13) from 80 to 90
   goals met: 10 of 13
60. (increment c13)
   changed: (value c13) from 90 to 100
   goals met: 11 of 13
61. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 11 of 13
62. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 11 of 13
63. (increment c10)
   changed: (value c10) from 5 to 12
   goals met: 11 of 13
64. (increment c10)
   changed: (value c10) from 12 to 19
   goals met: 11 of 13
65. (increment c10)
   changed: (value c10) from 19 to 26
   goals met: 11 of 13
66. (increment c10)
   changed: (value c10) from 26 to 33
   goals met: 11 of 13
67. (increment c10)
   changed: (value c10) from 33 to 40
   goals met: 11 of 13
68. (increment c10)
   changed: (value c10) from 40 to 47
   goals met: 12 of 13
69. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 12 of 13
70. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 12 of 13
71. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 12 of 13
72. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 12 of 13
73. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 12 of 13
74. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 12 of 13
75. (increment c4)
   changed: (value c4) from 15 to 21
   goals met: 11 of 13
76. (increment c5)
   changed: (value c5) from 16 to 20
   goals met: 11 of 13
77. (increment c5)
   changed: (value c5) from 20 to 24
   goals met: 11 of 13
78. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 11 of 13
79. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 11 of 13
80. (increment c4)
   changed: (value c4) from 21 to 29
   goals met: 10 of 13
81. (decrement c5)
   changed: (value c5) from 24 to 20
   goals met: 11 of 13
82. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 11 of 13
83. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 11 of 13
84. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 11 of 13
85. (increment c4)
   changed: (value c4) from 29 to 38
   goals met: 11 of 13
86. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 11 of 13
87. (increment c4)
   changed: (value c4) from 38 to 48
   goals met: 11 of 13
88. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 11 of 13
89. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 11 of 13
90. (increment c5)
   changed: (value c5) from 20 to 26
   goals met: 10 of 13
91. (increment c4)
   changed: (value c4) from 48 to 58
   goals met: 10 of 13
92. (decrement c3)
   changed: (value c3) from 59 to 57
   goals met: 11 of 13
93. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 11 of 13
94. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 11 of 13
95. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 11 of 13
96. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 11 of 13
97. (increment c5)
   changed: (value c5) from 26 to 36
   goals met: 11 of 13
98. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 11 of 13
99. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 11 of 13
100. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 11 of 13
101. (increment c6)
   changed: (value c6) from 22 to 25
   goals met: 11 of 13
102. (increment c6)
   changed: (value c6) from 25 to 28
   goals met: 11 of 13
103. (decrement c5)
   changed: (value c5) from 36 to 26
   goals met: 12 of 13
104. (decrement c4)
   changed: (value c4) from 58 to 48
   goals met: 11 of 13
105. (decrement c4)
   changed: (value c4) from 48 to 38
   goals met: 11 of 13
106. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 11 of 13
107. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 11 of 13
108. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 11 of 13
109. (decrement c3)
   changed: (value c3) from 57 to 52
   goals met: 11 of 13
110. (decrement c3)
   changed: (value c3) from 52 to 47
   goals met: 11 of 13
111. (decrement c3)
   changed: (value c3) from 47 to 42
   goals met: 11 of 13
112. (decrement c3)
   changed: (value c3) from 42 to 37
   goals met: 12 of 13
113. (increment c5)
   changed: (value c5) from 26 to 36
   goals met: 11 of 13
114. (increment c6)
   changed: (value c6) from 28 to 31
   goals met: 10 of 13
115. (increment c6)
   changed: (value c6) from 31 to 34
   goals met: 10 of 13
116. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 10 of 13
117. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 10 of 13
118. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 10 of 13
119. (increment c7)
   changed: (value c7) from 29 to 32
   goals met: 9 of 13
120. (increment c8)
   changed: (value c8) from 30 to 33
   goals met: 10 of 13
121. (increment c7)
   changed: (value c7) from 32 to 35
   goals met: 10 of 13
122. (increment c8)
   changed: (value c8) from 33 to 36
   goals met: 11 of 13
123. (increment c6)
   changed: (value c6) from 34 to 37
   goals met: 11 of 13
124. (increment c7)
   changed: (value c7) from 35 to 38
   goals met: 11 of 13
125. (increment c8)
   changed: (value c8) from 36 to 39
   goals met: 12 of 13
126. (decrement c4)
   changed: (value c4) from 38 to 28
   goals met: 12 of 13
127. (decrement c3)
   changed: (value c3) from 37 to 32
   goals met: 11 of 13
128. (decrement c3)
   changed: (value c3) from 32 to 27
   goals met: 12 of 13
129. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 12 of 13
130. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 12 of 13
131. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 12 of 13
132. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 12 of 13
133. (increment c3)
   changed: (value c3) from 27 to 36
   goals met: 12 of 13
134. (increment c4)
   changed: (value c4) from 28 to 38
   goals met: 12 of 13
135. (increment c5)
   changed: (value c5) from 36 to 46
   goals met: 12 of 13
136. (increment c6)
   changed: (value c6) from 37 to 40
   goals met: 11 of 13
137. (increment c7)
   changed: (value c7) from 38 to 41
   goals met: 11 of 13
138. (increment c8)
   changed: (value c8) from 39 to 42
   goals met: 12 of 13
139. (increment c6)
   changed: (value c6) from 40 to 43
   goals met: 11 of 13
140. (increment c7)
   changed: (value c7) from 41 to 44
   goals met: 11 of 13
141. (increment c8)
   changed: (value c8) from 42 to 45
   goals met: 11 of 13
142. (increment c6)
   changed: (value c6) from 43 to 46
   goals met: 10 of 13
143. (increment c7)
   changed: (value c7) from 44 to 47
   goals met: 10 of 13
144. (increment c8)
   changed: (value c8) from 45 to 48
   goals met: 11 of 13
145. (increment c6)
   changed: (value c6) from 46 to 49
   goals met: 11 of 13
146. (increment c7)
   changed: (value c7) from 47 to 50
   goals met: 11 of 13
147. (increment c8)
   changed: (value c8) from 48 to 51
   goals met: 12 of 13
148. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 12 of 13
149. (increment c9)
   changed: (value c9) from 45 to 49
   goals met: 11 of 13
150. (increment c10)
   changed: (value c10) from 47 to 54
   goals met: 12 of 13
151. (increment c9)
   changed: (value c9) from 49 to 53
   goals met: 13 of 13
